 
 gcc -g p2final.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x7b4: file p2final.c, line 19.
(gdb) r
Starting program: /home/runner/pps-test1-Pavangowda-B-N-2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2final.c:19
19    printf("enter first number=");
(gdb) n
20    int a=input();
(gdb) n
enter first number=20
21    printf("enter second number=");
(gdb) n
22    int b=input();
(gdb) n
enter second number=16
23    int sum=add(a,b);
(gdb) p a
$1 = 20
(gdb) p b
$2 = 16
(gdb) n
24    output(a,b,sum);
(gdb) p sum
$3 = 36
(gdb) n
25    return 0;
(gdb) n
26  }
(gdb) q
A debugging session is active.

    Inferior 1 [process 1111] will be killed.

Quit anyway? (y or n) y